Repository: 84000/data-translation-memory
Catalog: Toh_164-The_Questions_of_Ratnacandra-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རིན་ཆེན་ཟླ་བས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of Ratna­candra

source: ཐམས་ཅད་མཁྱེན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Omniscient One.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་
en: The Blessed One was residing in Rājagṛha, on Vulture Peak Mountain,

source: ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་སོགས་པ་དགེ་སློང་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཀྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་རྣམས་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: together with a large community of 7,200,000 monks, including Śāriputra and Maudgal­yāyana.

source: བྱང་ཆུབ་སེམས་དཔའ་དགུ་ཁྲི་ལ་
en: There were also 90,000 bodhisattvas,

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་མི་ཟད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་མཐའ་ཡས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་བརྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁམས་གསུམ་རྣམ་པར་གནོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རིན་པོ་ཆེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨན་གྱི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་ཆེན་འབྱུང་གནས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་སྡུག་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དགུ་ཁྲི་དང་།
en: including the bodhisattva great being Maitreya, the bodhisattva great being Mañjuśrī, the bodhisattva great being Akṣaya­mati, the bodhisattva great being Sāgara­mati, the bodhisattva great being Ananta­mati, the bodhisattva great being Dṛḍhamati, the bodhisattva great being Dispeller of the Three Realms, the bodhisattva great being Ratnapāṇi, the bodhisattva great being Vaidyarāja, the bodhisattva great being Ratnākara, and the bodhisattva great being Joy and Sorrow.

source: ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་།
en: There were also many billions of gods, including the Four Great Kings;

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གཡོག་འཁོར་ལྷའི་བུ་འབུམ་ཕྲག་དུ་མ་དང་བཅས་པ་དང་།
en: Śakra, king of the gods, along with his millions of divine attendants;

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་གཡོག་འཁོར་ཚངས་རིས་ཀྱི་ལྷའི་བུ་འབུམ་ཕྲག་དུ་མ་དང་བཅས་པ་དང་།
en: and Brahmā, lord of the Enduring world, along with his millions of divine attendants from the Brahmā realm.

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཨེ་ལའི་འདབ་དང་། ཀླུའི་རྒྱལ་པོ་ཀུན་དུ་གྲགས་དང་། དེ་དག་ལ་སོགས་པ་ཀླུ་འབུམ་ཕྲག་དུ་མ་དང་།
en: There were also millions of nāgas, including the nāga king Sāgara, the nāga king Anavatapta, the nāga king Elapatra, and the nāga king Renowned .

source: གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འབྲོག་གནས་དང་། ཁབ་སྤུ་ཅན་དང་། རྩི་སྨན་དང་། བོང་བུ་དང་། དེ་དག་ལ་སོགས་པ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་འབུམ་ཕྲག་དུ་མ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: Along with them were millions of yakṣa generals, such as Āṭavaka, Sucīromā, Oṣadhi, and Gardabhaka.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ། ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ། ལྷུང་བཟེད་བསྣམས་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ལ་གཤེགས་སོ། །
en: One morning the Blessed One put on his lower garments and monk’s robes, took his alms bowl, and left for his alms round in Rājagṛha.

source: དེའི་ཚེ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སྲས་ཁྱེའུ་རིན་ཆེན་ཟླ་བ་ཞེས་བྱ་བ་གླང་པོ་ཆེའི་ལག་བརྒྱད་པ་ཞེས་བྱ་བ་
en: At the same time Prince Ratna­candra, son of King Bimbisāra, left the city of Rājagṛha riding an elephant known as Eight-Trunked.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བརྒྱན་ཅིང་གསེར་གྱི་དྲ་བས་གཡོགས་པ།
en: It was adorned with seven kinds of precious materials and covered with golden latticework.

source: དྲིལ་བུ་གཡེར་ཁ་དཔྱངས་པ། གསེར་གྱིས་སྤྲས་པའི་དར་གྱི་ལྡ་ལྡི་མང་པོས་མཛེས་པར་བྱས་པ།
en: Small bells were tied onto the elephant, which was further ornamented with tassels of golden brocade.

source: བདུག་པས་བདུགས་པ། མེ་ཏོག་སིལ་མས་གཏོར་བ། རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་བ།
en: As the prince emerged incense was burned, flower petals were scattered, and banners and flags were unfurled.

source: གདུགས་དང་ར་བས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པས་མཛེས་པར་བྱས་པ། སྟེགས་བུ་བདུན་གྱིས་ཁོ་ར་ཁོར་ཡུག་དག་བསྐོར་བ་ལ་ཞོན་ནས་
en: After riding through the city, which was decorated with parasols and fences, beautified with precious trees, and encircled by seven pavilions,

source: རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་ལྡན་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་སྟེ
en: he rode out of the capital displaying both royal wealth and power.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་སོང་བ་ལས་གཞོན་ནུ་རིན་ཆེན་ཟླ་བས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་
en: As Prince Ratna­candra was handing out alms to everyone present, he noticed the Blessed One walking in the distance.

source: མཛེས་པ། དད་པར་བྱ་བ། དབང་པོ་དུལ་བ། ཐུགས་དུལ་བ།
en: He was handsome and gracious, with peaceful faculties and mind.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ།
en: He had the most exquisite color.

source: དུལ་བ་དང་ཞི་བའི་མཆོག །དུལ་བ་དང་ཞི་བ་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ།
en: He was perfectly gentle and peaceful, the perfection of a gentle and peaceful being.

source: གཙོ་བོ་ཆེན་པོ། དབང་པོ་བསྲུངས་པ། དབང་པོ་ཐུལ་བ།
en: He had a great presence and was restrained and calm.

source: མཚོ་ལྟར་དང་ཞིང་གསལ་ལ་རྙོག་པ་མེད་པ།
en: Like a lake, he was clear and pristine.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་མངའ་བ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་བརྒྱན་པའི་སྐུ་གསེར་གྱི་མཆོད་སྡོང་ལྟར་
en: Like a golden reliquary, his noble body was adorned with the thirty-two major marks and the eighty minor marks of a great being.

source: འཕགས་ལ་དཔལ་གྱི་མཆོག་གིས་ལམ་མེ། ལྷན་ནེ། ལྷང་ངེ་སྟེ་གཤེགས་པ་མཐོང་ངོ་། །
en: Due to his supreme splendor, he was shining, bright, and resplendent.

source: མཐོང་ནས་ཀྱང་སེམས་དད་པར་གྱུར་ཏོ། །
en: Upon seeing the Blessed One, Ratna­candra was moved to faith.

source: སེམས་དད་པར་གྱུར་ནས་གླང་པོ་ཆེའི་སྟེང་ནས་སྐྱེན་པར་བབས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Filled with faith, he immediately alighted from the elephant and approached the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །བཅོམ་ལྡན་འདས་ལ་ཞེ་ས་དང་བཅས།
en: Prostrating at the feet of the Blessed One, he circumambulated him three times and sat to one side with deference and respect.

source: གུས་པ་དང་བཅས་པས་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སྲས་ཁྱེའུ་རིན་ཆེན་ཟླ་བས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Ratna­candra, son of King Bimbisāra, folded his palms together and bowed toward the Blessed One and spoke to him,

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་གང་དག་གིས་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅུ་པོ་དག་གི་མཚན་ཐོས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་
en: “O Blessed One, it is said that a faithful noble son or daughter who has heard the names of the ten thus-gone, worthy, perfect buddhas who dwell in the ten directions will not fall back from the unsurpassed and perfect state of awakening.

source: དེ་ལྟ་བུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Blessed One, please speak of this.

source: བདེ་བར་གཤེགས་པས་བཤད་དུ་གསོལ།
en: Thus-Gone One, please tell us about this.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སྲས་ཁྱེའུ་རིན་ཆེན་ཟླ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: In response, the Blessed One said to Ratna­candra, son of King Bimbisāra,

source: གཞོན་ནུ་ལེགས་སོ་ལེགས་སོ། །
en: “Prince, well done! Well done indeed.

source: གཞོན་ནུ་ཁྱོད་འདི་ལྟར་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་དང་།
en: Prince, you ask this in order to benefit many beings and bring them happiness.

source: འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེའི་དོན་དང་། ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཞུགས་པ་དང་། ད་ལྟར་དང་། མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཞུགས་ཏེ
en: You do so out of love for the world and for the welfare of many beings, to benefit and bring happiness to gods and humans alike, and to assist the bodhisattvas of the present and the future.

source: གཞོན་ནུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་དོན་འདི་ཞུ་བར་སེམས་པ་ལེགས་སོ། །
en: Prince, it is excellent you thought to ask the thus-gone, worthy, perfect Buddha about this point.

source: གཞོན་ནུ་ཁྱོད་ཀྱི་ཞུ་བ་བཟང་སྟེ་སྤོབས་པ་དགེའོ། །
en: Prince, your request is excellent, and it is virtuous that you were moved to articulate it.

source: དེའི་ཕྱིར་གཞོན་ནུ་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: Therefore, Prince, listen carefully and keep this teaching in mind.

source: སེམས་རྩེ་གཅིག་ཏུ་རྣ་བ་བླགས་ཏེ་སེམས་སྡུས་ལ་སོམས་ཤིག་དང་། དོན་དེ་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: Listen to me with one-pointed concentration and reflect on what I say as I explain this teaching to you.”

source: དེ་ནས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སྲས་ཁྱེའུ་རིན་ཆེན་ཟླ་བས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ནས་
en: Ratna­candra, son of King Bimbisāra, replied to the Blessed One, “Excellent!”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: And he listened as the Blessed One had directed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then said,

source: གཞོན་ནུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མེད་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད་པ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དོ། །
en: “Prince, east of this buddha realm, past countless, inconceivably many, limitless billions of buddha realms, there is a realm called Sorrowless.

source: འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ཞེས་བྱ་བ་དེ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ་ཇི་སྙེད་ཅིག་འདས་པ་ན་ཡོད་ཅེ་ན།
en: You may wonder how many boundless buddha realms one must pass through to reach that realm.

source: གཞོན་ནུ་དཔེར་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྲིད་པའི་རྩེ་མོའི་བར་དུ་བྱེ་མས་ཡོངས་སུ་གང་བར་གྱུར་ལ།
en: Well, Prince, suppose the entire trichiliocosm was completely filled with sand, all the way to its summits.

source: དེ་ནས་མི་ལ་ལ་ཞིག་གིས་བྱེ་མ་དེའི་ས་འབྲུ་རེ་རེ་ནས་བླངས་ཤིང་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེར་བྱེ་མ་འབྲུ་རེ་འཇོག་པར་བྱེད་པ་དེ་ལྟ་བུའི་ཚུལ་གྱིས་བྱེ་མ་དེ་ཐམས་ཅད་ཤར་ཕྱོགས་སུ་ཡོངས་སུ་ཟད་ཅིང་ཡོངས་སུ་གཏུགས་པར་གྱུར་ཀྱང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་གི་ཚད་དམ་མཐའ་རྟོགས་པར་མི་ནུས་པའི་
en: If a person were to remove the sand, grain by grain, and place one grain of sand in each buddha realm toward the east until every single grain of sand was placed in a buddha realm in that direction, one would still not have reached the extent and limit of those buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ཞེས་བྱ་བ་དེ་ཡོད་དེ
en: The realm called Sorrowless lies farther away than such boundless and countless billions of buddha realms.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ལེགས་པར་བརྒྱན་པ། གསེར་གྱི་ས་གཞིར་འདུག་ཅིང་།
en: That realm is as flat as the palm of the hand, is beautifully decorated with seven kinds of precious substances, and has a ground made of gold.

source: མིག་མངས་རིས་སུ་བྲིས་པ། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པས་བརྒྱན་པ།
en: It is laid out in a checkered pattern and ornamented with precious trees.

source: སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། ཡི་དགས་དང་། ལྷ་མ་ཡིན་གྱི་ཚོགས་རྣམས་མེད་པ།
en: There are no hell beings, animals, hungry spirits, or asuras there,

source: རྩྭ་དང་། ཤིང་སྐམ་དང་། ཚེར་མ་དང་། རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་དག་མེད་པ། ངམ་གྲོག་དང་གཡང་ས་མེད་པ།
en: and it is free of grass, dried sticks, thorns, stones, pebbles, gravel, ravines, and precipices.

source: མེ་ཏོག་སིལ་མ་དག་བཀྲམ་པ་ཡིན་ཏེ
en: Instead, the ground is covered in flower petals.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་རྫོགས་པའི་སངས་རྒྱས་དཔལ་བཟང་པོ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་། བྱང་ཆུབ་སེམས་དཔས་མདུན་གྱིས་བལྟས་པ།
en: “There the thus-gone, worthy, perfect buddha Bhadraśrī resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་
en: He is learned and venerable, a blissful one, a knower of the world, a steersman who guides beings, an unexcelled one, a teacher of gods and humans, a blessed buddha.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པའི་སྐུ། གསེར་ལེགས་པར་བཙོས་ཤིང་ལེགས་པར་དུལ་བ་ལྟ་བུ་རིན་པོ་ཆེའི་རྒྱན་
en: His body, which is adorned with the thirty-two marks of a great being, is like purified and refined gold adorned with precious ornaments.

source: ལེགས་པར་བཀོད་པ་བཞིན་དུ་འཁོར་གྱི་ནང་ན་མཛེས་པར་བཞུགས་ཤིང་། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བའི་ཆོས་སྟོན་ཏོ། །
en: Sitting beautifully amidst the gathering, he teaches a Dharma that is virtuous in the beginning, virtuous in the middle, and virtuous in the end.

source: འདི་སྐད་ཅེས་ཀྱང་སྟོན་ཏེ།
en: He teaches as follows:

source: འདི་ལྟར་སའི་ཁམས་ནི་མེད་པར་མི་འགྱུར་རོ། །དེ་བཞིན་དུ་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་།
en: ‘In this way the earth element will not become nonexistent, nor will the water element, the fire element, or the wind element.

source: སྐྱེ་དགུའི་བདག་པོ་ཚངས་པ་དང་། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མེད་པར་མི་འགྱུར་རོ་ཞེས་སྟོན་ཏོ། །
en: Likewise, Brahmā who is the lord of beings will not become nonexistent, and the same applies to form, feeling, perception, formation, and consciousness.’

source: གཞོན་ནུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་བཟང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ལོན་ནོ། །
en: Prince, it has been six hundred million eons since the thus-gone, worthy, perfect buddha Bhadraśrī fully awakened to unsurpassed and perfect buddhahood.

source: གཞོན་ནུ་གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉིན་མོ་དང་། མཚན་མོའི་མིང་ཡང་མེད་དེ། འཛམ་བུའི་གླིང་གི་རྩི་བའི་ཐབས་འདིས་དཔེར་བྱ་བ་ནི་མ་གཏོགས་སོ། །
en: “Prince, in that buddha realm there are no words for day and night , and there is nothing analogous to that calculation of time used in our world.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐམས་ཅད་ཀྱང་རྟག་ཏུ་དེ་བཞིན་གཤེགས་པ་དེའི་འོད་ཀྱིས་སྣང་བར་འདུག་གོ། །
en: The entire buddha realm is permanently illuminated with the light of the thus-gone one.

source: གཞོན་ནུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དེས་ཆོས་བསྟན་པ་རེ་རེས་ཀྱང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་འགོད་པར་མཛད་དོ། །
en: Moreover, Prince, every teaching given by the thus-gone one establishes countless billions of beings at the level of unborn phenomena.

source: བཟོད་པ་དང་པོ་དང་། བཟོད་པ་གཉིས་པ་དང་། བཟོད་པ་གསུམ་པ་ལ་ནི་དེའི་ཉིས་འགྱུར་འགོད་པར་མཛད་དོ། །
en: He establishes twice as many beings in each of the three types of acceptance.

source: གཞོན་ནུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་བསྐྱེད་པས་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ན་གང་དག་སྔོན་གྱི་རྒྱལ་བ་རྣམས་ལ་ལྷག་པར་བྱ་བ་བྱས་ཤིང་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སེམས་ཅན་དག་གི་ལུས་ལ་འོད་ཀྱིས་རེག་པ་དེ་དག་ཀྱང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: Furthermore, Prince, sentient beings who served past buddhas in other buddha realms and produced roots of virtue with them will attain acceptance that phenomena are unborn when touched by the light born from the power generated from the past aspirations of this thus-gone, worthy, perfect buddha.

source: གཞོན་ནུ་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཡང་རུང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་བཟང་པོ་དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Prince, any noble son or daughter who hears the name of the thus-gone, worthy, perfect buddha Bhadraśrī will never turn back from unsurpassed and perfect awakening.

source: གཞོན་ནུ་འདི་ནས་ལྷོ་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་སྔ་མ་ཇི་སྙེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་དགའ་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, south of here, past as many countless billions of buddha realms as mentioned before, there is a realm called Joy .

source: ལག་མཐིལ་ལྟར་མཉམ་པ་ཞེས་བྱ་བ་ནས་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: That realm is as flat as the palm of the hand and has all the other qualities previously described.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཙན་དན་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་བསྐོར་ཅིང་བྱང་ཆུབ་སེམས་དཔས་མདུན་གྱིས་བལྟས་པ་ལ་
en: There the thus-gone, worthy, perfect buddha Candanaśrī resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བའི་ཆོས་སྟོན་ཏོ། །
en: He teaches them a Dharma that is virtuous in the beginning, virtuous in the middle, and virtuous in the end.

source: ཞེས་བྱ་བ་ནས་རྣམ་པར་ཤེས་པ་མེད་པར་མི་འགྱུར་རོ། །ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: He also teaches the same Dharma mentioned previously, up until ‘consciousness.’

source: གཞོན་ནུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: Prince, what do you think?

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་ཙན་དན་དཔལ་ཞེས་བྱ་ཞེ་ན།
en: Why is the thus-gone one called Candanaśrī?

source: གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐམས་ཅད་ཙན་དན་གྱི་ཁང་པ་བརྩིགས་པས་ཡོངས་སུ་ཁྱབ་པས་ན།
en: The entire buddha realm of the thus-gone one is filled with houses built of sandalwood.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཙན་དན་དཔལ་ཞེས་བྱའོ། །
en: Therefore, the thus-gone one is called Candanaśrī.

source: གཞན་ཡང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Any noble son or daughter who hears the name of that thus-gone, worthy, perfect buddha will never turn back from unsurpassed and perfect awakening.

source: གཞོན་ནུ་འདི་ནས་ནུབ་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་སྔ་མ་ཇི་སྙེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, west of here, past as many countless billions of buddha realms as mentioned before, there is a realm called Excellence.

source: ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ་ཞེས་བྱ་བ་ནས་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། ཇི་ལྟར་གོང་དུ་བསྟན་པ་བཞིན་ནོ། །
en: That realm is as flat as the palm of the hand and has all the other qualities described above.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བ་མཐའ་ཡས་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་བསྐོར་ཅིང་། བྱང་ཆུབ་སེམས་དཔས་མདུན་གྱིས་བལྟས་པ་ལ་
en: There the thus-gone, worthy, perfect buddha Amitābha resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: འདི་སྐད་ཅེས་ཀྱང་ཆོས་སྟོན་ཏོ། །ཞེས་བྱ་བ་ནས་རྣམ་པར་ཤེས་པ་མེད་པར་མི་འགྱུར་རོ། །ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: He also teaches the same Dharma mentioned previously, up until ‘consciousness.’

source: གཞོན་ནུ་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཡང་རུང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་འོད་དེ་ཡང་ཉམས་སུ་མྱོང་ངོ་། །
en: Prince, any noble son or daughter who hears the name of that thus-gone, worthy, perfect buddha will never turn back from unsurpassed and perfect awakening and will experience that light.

source: གཞོན་ནུ་འདི་ནས་བྱང་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་སྔ་མ་ཇི་སྙེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་འཁྲུག་མེད་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, north of here, past as many countless billions of buddha realms as mentioned before, there is a realm called Without Conflict.

source: ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ་ཞེས་བྱ་བ་ནས་ཐམས་ཅད་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: That realm is as flat as the palm of the hand and has all the other qualities described above.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་གི་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་བསྐོར་ཅིང་བྱང་ཆུབ་སེམས་དཔས་མདུན་གྱིས་བལྟས་པ་ལ་
en: There the thus-gone, worthy, perfect buddha Floral Splendor resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: གཞོན་ནུ་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཡང་རུང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་མཚན་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་རྒྱལ་མཚན་ལྟ་བུར་འགྱུར་རོ། །
en: Prince, any noble son or daughter who hears the name of that thus-gone, worthy, perfect buddha will never turn back from unsurpassed and perfect awakening and will become like a victory banner for the world along with its gods.

source: གཞོན་ནུ་འདི་ནས་ཤར་ལྷོའི་ཕྱོགས་མཚམས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་སྣང་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, southeast of here, past countless billions of buddha realms, there is a realm called Moonlight.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་སྣང་བ་ཞེས་བྱ་ཞེ་ན།
en: Why is that world called Moonlight?

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དེའི་འོད་ཀྱིས་སྣང་བར་བྱས་པས་ན།
en: It is because the rays of light from its thus-gone one illuminate that entire realm.

source: དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཟླ་བ་སྣང་བ་ཞེས་བྱའོ། །
en: That is why that world is called Moonlight.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་པའི་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་བསྐོར་ཅིང་
en: There the thus-gone, worthy, perfect buddha Aśokaśrī resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: བྱང་ཆུབ་སེམས་དཔས་མདུན་གྱིས་བལྟས་པ་ལ་ཆོས་སྟོན་ཏོ་ཞེས་བྱ་བ་ནས་རྣམ་པར་ཤེས་པ་མེད་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: He teaches them the same Dharma mentioned previously, up until ‘consciousness.’

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་། དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Any noble son or daughter who hears his name will never turn back from unsurpassed and perfect awakening.

source: གཞོན་ནུ་འདི་ནས་ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཏོག་དང་ལྡན་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, southwest of here, past countless billions of buddha realms, there is a realm called Decorated with Banners.

source: ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ་ཞེས་བྱ་བ་ནས་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: That realm is as flat as the palm of the hand and has all the other qualities described above.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་མཆོད་སྡོང་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་བསྐོར་ཅིང་
en: There the thus-gone, worthy, perfect buddha Ratnayūpa resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་། དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་འཇིག་རྟེན་ན་རིན་པོ་ཆེ་ལྟར་མངོན་པར་འཕགས་པར་འགྱུར་རོ། །
en: Any noble son or daughter who hears his name will never turn back from unsurpassed and perfect awakening and will become as exalted as a jewel in the world.

source: གཞོན་ནུ་འདི་ནས་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྒྲ་ལྡན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, northwest of here, past countless billions of buddha realms, there is a realm called Resounding.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་སྒྲ་དང་ལྡན་ཞེས་བྱ་ཞེ་ན་
en: Why is that world called Resounding?

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་སྒྲ་འདི་ལྟ་བུ་དག་དང་ལྡན་ཏེ། འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། སྟོང་པ་ཉིད་ཀྱི་སྒྲ་དང་། མཚན་མ་མེད་པའི་སྒྲ་དང་། སྨོན་པ་མེད་པའི་སྒྲ་དང་།
en: It is because the realm is endowed with the sounds of ‘Buddha,’ ‘Dharma,’ and ‘Saṅgha,’ as well as ‘emptiness,’ ‘signlessness,’ and ‘wishlessness.’
